output/baseline_A_team_release/wo006_su2_baseline_validation/cfd_release_v0_true_baseline_domain_convention_fix/openfoam_cases/true_baseline_swept_cgrid_halfwing_convention/system/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
ddtSchemes
{
    default         steadyState;
}
gradSchemes
{
    default         cellLimited Gauss linear 1;
}
divSchemes
{
    default                         none;
    div(phi,U)                      bounded Gauss upwind;
    div(phi,nuTilda)                bounded Gauss upwind;
    div((nuEff*dev2(T(grad(U)))))   Gauss linear;
}
laplacianSchemes
{
    default         Gauss linear limited 0.5;
}
interpolationSchemes
{
    default         linear;
}
snGradSchemes
{
    default         limited 0.5;
}
wallDist
{
    method          meshWave;
}
