output/baseline_A_team_release/wo006_su2_baseline_validation/cfd_release_v0_true_baseline_domain_convention_fix/openfoam_cases/true_baseline_swept_cgrid_halfwing_convention/system/meshQualityDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      meshQualityDict;
}
#includeEtc "caseDicts/meshQualityDict"
maxNonOrtho     90;
maxBoundarySkewness 20;
maxInternalSkewness 4;
maxConcave      80;
minFlatness     0.5;
minVol          1e-18;
minTetQuality   -1e30;
minArea         -1;
minTwist        0.02;
minDeterminant  0.001;
minFaceWeight   0.02;
minVolRatio     0.01;
minTriangleTwist -1;
nSmoothScale    4;
errorReduction  0.75;
